Artillery/load-test.yml
config:
  environments:
    debug:
      target: "http://localhost:5050"
      ensure:
        maxErrorRate: 1
      phases:
        - duration: 60
          arrivalRate: 2
          name: moderate and sustained load
        - duration: 60
          arrivalRate: 10
          name: heavy load
    local:
      target: "http://localhost:41558"
      ensure:
        maxErrorRate: 1
      phases:
        - duration: 60
          arrivalRate: 2
          name: moderate and sustained load
        - duration: 60
          arrivalRate: 10
          name: heavy load
    prod:
      target: "https://freddycoder.com/fhir-api"
      ensure:
        maxErrorRate: 1
      phases:
        - duration: 60
          arrivalRate: 5
          name: Warm up
        - duration: 120
          arrivalRate: 5
          rampTo: 50
          name: Ramp up load
        - duration: 600
          arrivalRate: 50
          name: Sustained load
  payload:
    path: "requests.csv"
    delimiter: "~"
    options:
        quote: ''
    fields:
      - "request"
  defaults:
    headers:
      Content-Type: "application/xml"
      SOAPAction: '"http://tempuri.org/IPatientRegistry/FindCandidates"'
scenarios:
  - name: "FindCandidate"
    flow:
      - post:
          url: "/Registry/PatientRegistry.svc"
          body: '{{ request }}'